# FilledRegionMasking Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FilledRegionMasking Property
ParameterTypeId Class See Also
---
"Masking"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FilledRegionMasking { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FilledRegionMasking As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FilledRegionMasking {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace